Revit 2024 API
ParameterUtils.DownloadCompanyName Method
 Downloads the name of the given parameter's owning account and records it in the given document. If the owning account's name is already recorded in the given document, this method returns the name without downloading it again.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2024
Syntax
C#
public static string DownloadCompanyName(
	Document document,
	ForgeTypeId parameterTypeId
)
Visual Basic
Public Shared Function DownloadCompanyName ( _
	document As Document, _
	parameterTypeId As ForgeTypeId _
) As String
Visual C++
public:
static String^ DownloadCompanyName(
	Document^ document,
	ForgeTypeId^ parameterTypeId
)
Parameters
document
Type: Autodesk.Revit.DB.Document
 Document in which to record the name of the parameter's owning account.
parameterTypeId
Type: Autodesk.Revit.DB.ForgeTypeId
 Parameter identifier.
Return Value
 Name of the owning account.
Remarks
 In Revit, the account name appears in the parameter tooltip if available.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.AccessDeniedException |  Thrown when the user is not authorized to access the requested information.
Autodesk.Revit.Exceptions.ArgumentException |  Thrown when the parameter identifier does not include an account identifier.
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was null
[!:Autodesk::Revit::Exceptions::NetworkCommunicationError] |  Thrown when communication with the remote service is unsuccessful.
Autodesk.Revit.Exceptions.ResourceNotFoundException |  Thrown when the requested information is not found.
Autodesk.Revit.Exceptions.ServerInternalException |  Thrown when the remote service reports an internal error.
Autodesk.Revit.Exceptions.UnauthenticatedException |  Thrown when the user is not signed in.
See Also
ParameterUtils Class
Autodesk.Revit.DB Namespace